void main() {
  //   Завдання 7: Конструкція switch statement
  // 1) Створіть змінну dayNumber від 1 до 7.
  // 2) Використайте switch, щоб вивести:
  // Понеділок, Вівторок, …, Неділя.
  // 3) Якщо день не від 1 до 7 — вивести “Невірний номер дня”.
  // 4) Додатково: для вихідних (6, 7) вивести “Вихідний день 🎉”.

  final int dayNumber = 5;

  switch (dayNumber) {
    case 1:
      print('Понеділок');
    case 2:
      print('Вівторок');
    case 3:
      print('Середа');
    case 4:
      print('Четвер');
    case 5:
      print('П\'ятниця');
    case 6:
      print('Субота');
      print('Вихідний день 🎉');
    case 7:
      print('Неділя');
      print('Вихідний день 🎉');

    default:
      print('Невірний номер дня');
  }
}
