// Task 2: Множини (Set)

// 1. Створіть окремий файл names.dart.
// 2. У цьому файлі створіть дві змінні:
// - List<String> ukrainianNames1
// - List<String> ukrainianNames2
// 3. За допомогою ChatGPT згенеруйте список із 50 українських імен та збережіть його в ukrainianNames1.
// 4. За допомогою DeepSeek згенеруйте інший список із 50 українських імен для ukrainianNames2.
// 5. Поверніться до основного файлу з домашнім завданням (lib/main.dart).
// 6. Створіть Set uniqueNames1 і додайте до нього всі імена з ukrainianNames1.
// 7. Створіть Set uniqueNames2 і додайте до нього всі імена з ukrainianNames2.
// 8. Створіть новий Set зі спільними іменами обох списків. Виведіть кількість елементів у цій множині.
// 9. Створіть множину з іменами, що є в uniqueNames1, але яких немає в uniqueNames2. Виведіть ці імена.
// 10. Створіть множину з іменами, що є в uniqueNames2, але яких немає в uniqueNames1. Виведіть ці імена.

void main() {
  List<String> ukrainianNames1 = [
    'Артем',
    'Богдан',
    'Владислав',
    'Володимир',
    'Григорій',
    'Дмитро',
    'Євген',
    'Захар',
    'Іван',
    'Ігор',
    'Кирило',
    'Лев',
    'Максим',
    'Микита',
    'Михайло',
    'Назар',
    'Олег',
    'Олександр',
    'Павло',
    'Петро',
    'Роман',
    'Сергій',
    'Станіслав',
    'Тарас',
    'Юрій',
    'Аліна',
    'Ангеліна',
    'Анна',
    'Богдана',
    'Валерія',
    'Вікторія',
    'Ганна',
    'Дарина',
    'Євгенія',
    'Злата',
    'Ірина',
    'Катерина',
    'Ксенія',
    'Леся',
    'Лідія',
    'Марина',
    'Марія',
    'Мирослава',
    'Наталія',
    'Оксана',
    'Олена',
    'Ольга',
    'Світлана',
    'Соломія',
    'Юлія',
  ];

  List<String> ukrainianNames2 = [
    'Олександр',
    'Іван',
    'Микола',
    'Олег',
    'Андрій',
    'Віктор',
    'Тарас',
    'Юрій',
    'Володимир',
    'Богдан',
    'Євген',
    'Дмитро',
    'Анатолій',
    'Руслан',
    'Сергій',
    'Леонід',
    'Василь',
    'Павло',
    'Григорій',
    'Костянтин',
    'Ігор',
    'Максим',
    'Віталій',
    'Захар',
    'Роман',
    'Степан',
    'Михайло',
    'Людмила',
    'Наталя',
    'Ольга',
    'Тетяна',
    'Ірина',
    'Світлана',
    'Віра',
    'Аліна',
    'Катерина',
    'Марія',
    'Ніна',
    'Любава',
    'Євдокія',
    'Лариса',
    'Ганна',
    'Вероніка',
    'Зінаїда',
    'Віра',
    'Дарина',
    'Карина',
    'Валентина',
    'Аліса',
    'Юлія',
  ];

  Set<String> uniqueNames1 = ukrainianNames1.toSet();
  Set<String> uniqueNames2 = ukrainianNames2.toSet();

  Set<String> commonNames = {};
  // 1 variant
  for (final name in uniqueNames1) {
    if (uniqueNames2.contains(name)) commonNames.add(name);
  }
  // 2 variant
  // commonNames = uniqueNames1.intersection(uniqueNames2);
  print(
    'Виведіть кількість елементів множини commonNames: ${commonNames.length}',
  );
  print('-------------------------------------------------');
  final difference1 = uniqueNames1.difference(uniqueNames2);
  print(
    'Імена, що є в uniqueNames1, але яких немає в uniqueNames2: $difference1',
  );
  print('-------------------------------------------------');
  final difference2 = uniqueNames2.difference(uniqueNames1);
  print(
    'Імена, що є в uniqueNames2, але яких немає в uniqueNames1: $difference2',
  );
}
