void main() {
  final person = Person('Oleh', 29);

  person.sayHello();
}

class Person {
  // Звичайний коструктор

  Person(String name, int age) : this.name = name, this.age = age {
    //do some init job here
  }

  String name;
  int age;

  void sayHello() {
    print('Hi, my name is $name and I am $age years old.');
  }
}

// Конструктор складається з параметрів, списку ініціалізації та тіла конструктора.
// У списку ініціалізації задаються значення для полів обʼєкта ще до виконання тіла конструктора.
// У тілі конструктора ми вже маємо повністю створений обʼєкт і можемо звертатися до його полів через ключове слово this.
// Ключове слово this використовується для того, щоб чітко вказати на поле обʼєкта, коли його імʼя збігається з іменем параметра.
// Якщо поля класу є публічними та мають ті самі імена, що й вхідні параметри, Dart дозволяє скоротити запис:
// Person(this.name, this.age)
